Autodesk.Navisworks.Api.Plugins.InterfaceAttribute
Attribute that declares a plugin implements a particular interface or behaviours.

Autodesk.Navisworks.Api.Plugins.InterfaceAttribute.#ctor(System.String,System.String)
Attribute that declares a plugin implements particular interface or behaviour.
The combination of Name and DeveloperId is used
to form an Id that identifies which interface is being supported.
name:
The name of the interface.
developerId:
The 4 character ADN developer code or a GUID.

Autodesk.Navisworks.Api.Plugins.InterfaceAttribute.DeveloperId
The 4 character ADN developer code or a GUID. The combination of this and Name is used
to form and Id that identifies which interface is being supported.

Autodesk.Navisworks.Api.Plugins.InterfaceAttribute.DisplayName
Optional additional information about the interface implementation

Autodesk.Navisworks.Api.Plugins.InterfaceAttribute.Name
The name of the Inteface. The combination of this and DeveloperId is used
to form an Id that identifies which interface is being supported.

Autodesk.Navisworks.Api.Plugins.InterfaceAttribute.UserData
Optional additional information about the interface implementation